Repository: JiangNanGenius/floe-agent
Catalog: FloeAgent/FloeApp/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# connectors.summary
source: GitHub accounts and standard MCP tool sources
zh_hans: GitHub 账户与标准 MCP 工具来源

# connectors.title
source: Connectors
zh_hans: 连接器

# connectors.tool_sources
source: Tool sources
zh_hans: 工具来源

# conversations.remote_video_tools.did_not_provide_a_supported_reference
source: %@ did not provide a supported reference image/first-frame input; use a model with referenceImage.supported=true in video.models.
zh_hans: %@ 未提供受支持的参考图/首帧输入；请使用 video.models 中 referenceImage.supported=true 的模型。

# conversations.remote_video_tools.reference_image_attachments_must_be_images
source: Reference image attachments must be images
zh_hans: 参考图附件必须是图片

# conversations.remote_video_tools.the_reference_image_exceeds_the_byte
source: The reference image exceeds the %@-byte limit
zh_hans: 参考图超过 %@ 字节上限

# conversations.remote_video_tools.this_attachment_belongs_to_another_conversation
source: This attachment belongs to another conversation and cannot be used as a reference image
zh_hans: 该附件属于其它对话，不能作为参考图

# conversations.remote_video_tools.veo_reference_images_require_durationseconds_8
source: Veo reference images require durationSeconds=8, or omit the parameter to use the provider default.
zh_hans: Veo 参考图要求 durationSeconds=8，或省略该参数使用供应商默认值。

# core.canvas_copy_fork_planner.drawing_drafts_take_mb_files_over
source: Drawing drafts take %@ MB (%@ files), over the %@ MB budget; unapplied drafts were kept.
zh_hans: 图纸草稿占用 %@ MB（%@ 份），超过 %@ MB 预算；未应用的草稿已保留。

# core.canvas_copy_fork_planner.no_bindable_editing_project_the_export
source: No bindable editing project; the export was saved to the asset library.
zh_hans: 没有可绑定的编辑工程；导出结果已保存到素材库。

# core.canvas_copy_fork_planner.the_drawing_content_is_empty_nothing
source: The drawing content is empty; nothing was applied to the canvas.
zh_hans: 图纸内容为空，未应用到画布。

# core.canvas_copy_fork_planner.the_drawing_is_missing_its_content
source: The drawing is missing its content hash, so the original version cannot be compared safely.
zh_hans: 图纸缺少内容哈希，无法安全比较原始版本。

# core.canvas_copy_fork_planner.the_migration_marker_is_missing_the
source: The migration marker is missing the exported asset and cannot be retried.
zh_hans: 迁移标记缺少导出素材，无法重试。

# core.canvas_copy_fork_planner.the_node_asset_changed_during_editing
source: The node asset changed during editing; the export was saved to the asset library and the original node was not modified.
zh_hans: 节点素材在编辑期间已改变；导出结果已保存到素材库，原节点未修改。

# core.canvas_copy_fork_planner.the_node_drawing_changed_during_editing
source: The node drawing changed during editing; the draft was kept and the original node was not modified.
zh_hans: 节点图纸在编辑期间已改变；草稿已保留，原节点未修改。

# core.canvas_copy_fork_planner.the_original_canvas_node_no_longer
source: The original canvas node no longer exists; the export was saved to the asset library.
zh_hans: 原画布节点已不存在；导出结果已保存到素材库。

# core.canvas_copy_fork_planner.the_original_canvas_node_no_longer_2
source: The original canvas node no longer exists; the drawing draft was kept.
zh_hans: 原画布节点已不存在；图纸草稿已保留。

# core.canvas_copy_fork_planner.this_node_cannot_be_migrated_in
source: This node cannot be migrated in place (%@); create a branch node instead.
zh_hans: 该节点不能就地迁移（%@）；可新建分支节点。

# core.canvas_copy_fork_planner.this_node_has_no_local_drawing
source: This node has no local drawing file.
zh_hans: 该节点没有本地图纸文件。

# core.canvas_copy_fork_planner.this_node_is_not_an_editable
source: This node is not an editable DWG/DXF drawing.
zh_hans: 该节点不是可编辑的 DWG/DXF 图纸。

# core.canvas_operations.generating_image
source: Generating image
zh_hans: 图片生成中

# core.canvas_operations.generating_video
source: Generating video
zh_hans: 视频生成中

# core.canvas_operations.generation_input
source: Generation input
zh_hans: 生成输入

# core.canvas_operations.generation_result
source: Generation result
zh_hans: 生成结果

# core.canvas_operations.the_image_service_should_return_images
source: The image service should return %@ images but returned %@; this was not submitted as partial success. Retry from the configuration node.
zh_hans: 图片服务应返回 %@ 张图片，但实际返回 %@ 张；本次没有按部分成功提交，请从配置节点重试。

# core.canvas_operations.video_generation
source: Video generation
zh_hans: 视频生成

# core.canvas_project_models.generation_configuration
source: Generation configuration
zh_hans: 生成配置

# core.canvas_project_models.subject
source: Subject
zh_hans: 主体

# core.data_floe_contents_of.could_not_read_the_file_it
source: Could not read the file “%@”: it may be damaged or in use by another process
zh_hans: 无法读取文件「%@」：文件可能已损坏或正在被其他进程占用

# core.data_floe_contents_of.failed_to_read_the_file
source: Failed to read the file “%@”: %@
zh_hans: 读取文件「%@」失败：%@

# core.data_floe_contents_of.file_does_not_exist
source: File does not exist: %@
zh_hans: 文件不存在：%@

# core.data_floe_contents_of.no_permission_to_read_the_file
source: No permission to read the file “%@”
zh_hans: 没有权限读取文件「%@」

# core.heavy_runtime_arbiter.a_task_is_still_using_the
source: A task is still using the local model, so the Linux environment cannot start until it is released; finish that task and try again.
zh_hans: 本地模型仍被某个任务占用，无法在释放前启动 Linux 环境；请结束该任务后重试。

# core.heavy_runtime_arbiter.the_linux_environment_did_not_stop
source: The Linux environment did not stop in time, so this local model request was canceled.
zh_hans: Linux 环境未能在预期时间内停止，已取消本次本地模型请求。

# core.heavy_runtime_arbiter.the_local_model_needs_the_running
source: The local model needs the running Linux environment stopped first, but that action cannot be confirmed right now.
zh_hans: 本地模型需要先停止正在运行的 Linux 环境，但当前无法确认该操作。

# core.heavy_runtime_arbiter.the_local_model_run_was_canceled
source: The local model run was canceled: the Linux environment is still running and the two cannot run at the same time.
zh_hans: 本地模型已取消：Linux 环境仍在运行，两者不能同时使用。

# core.layout_display.files
source: Files
zh_hans: 文件

# core.layout_display.large
source: Large
zh_hans: 大

# core.layout_display.layers
source: Layers
zh_hans: 图层

# core.layout_display.small
source: Small
zh_hans: 小

# core.linux_background_surface.command_service_port
source: Command %@ · service %@ · port %@
zh_hans: 命令 %@ · 服务 %@ · 端口 %@

# core.linux_background_surface.cpu_memory
source: CPU %@ · Memory %@
zh_hans: CPU %@ · 内存 %@

# core.linux_background_surface.interrupted
source: Interrupted
zh_hans: 已中断

# core.linux_background_surface.paused
source: Paused
zh_hans: 已暂停

# core.linux_background_surface.ran
source: Ran %@
zh_hans: 已运行 %@

# core.linux_background_surface.wrapping_up
source: Wrapping up
zh_hans: 收尾中

# core.managed_python_package_spec_parser.pip_install_requires_1_16_package
source: pip install requires 1–16 package names
zh_hans: pip install 需要 1–16 个包名

# core.managed_python_package_spec_parser.pip_list_supports_only_format_json
source: pip list supports only --format=json
zh_hans: pip list 仅支持 --format=json

# core.managed_python_package_spec_parser.pip_show_accepts_only_a_package
source: pip show accepts only a package name
zh_hans: pip show 只接受包名

# core.managed_python_package_spec_parser.pip_uninstall_takes_one_package_name
source: pip uninstall takes one package name at this layer at a time
zh_hans: pip uninstall 每次指定一个本层包名

# core.managed_python_package_spec_parser.specify_1_16_package_names
source: Specify 1–16 package names
zh_hans: 请指定 1–16 个包名

# core.managed_python_package_spec_parser.supported_commands
source: Supports pip install, uninstall, list, show, freeze, check and --version; native packages need compatible builds.
zh_hans: 支持 pip install、uninstall、list、show、freeze、check 与 --version；原生包需要兼容构建

# core.managed_python_package_spec_parser.this_pip_command_takes_no_extra
source: This pip command takes no extra arguments
zh_hans: 此 pip 命令不接受额外参数

# core.task_notification_outbox.notifications_available
source: %@ (notifications available)
zh_hans: %@（可显示通知）

# core.task_notification_outbox.notifications_unavailable
source: %@ (notifications unavailable)
zh_hans: %@（无法显示通知）

source: Appearance is currently fixed; choose “Automatic” to follow the system again.
zh_hans: 当前已固定外观，选择「自动」即可恢复跟随系统。

source: Switches automatically with the system appearance. Scheduled or sunset switching can be set in iOS “Settings → Display & Brightness → Automatic”.
zh_hans: 自动随系统外观切换。定时或日落切换可在 iOS「设置 → 显示与亮度 → 自动」中设置。

# design.composer_return_field.chars
source: chars
zh_hans: 字

# diagnostics.logging.debug
source: Debug
zh_hans: 调试

# diagnostics.logging.error
source: Errors
zh_hans: 错误

# diagnostics.logging.explanation
source: Records the selected level and higher. Changes apply immediately; enabling debug does not upload logs.
zh_hans: 记录所选等级及更严重的日志，即时生效。开启调试不会自动上传日志。

# diagnostics.logging.info
source: Information
zh_hans: 信息

# diagnostics.logging.level
source: Recording Level
zh_hans: 记录等级

# diagnostics.logging.settings
source: Log Settings
zh_hans: 日志设置

# diagnostics.logging.warning
source: Warnings
zh_hans: 警告

# documents.office_native_save_validation.the_slide_chart_data_was_not
source: The slide chart data was not fully saved; an edited copy was kept and the original file was not overwritten.
zh_hans: 幻灯片图表的数据未完整保存，已保留编辑副本，原文件未被覆盖。

# documents.office_opening_policy.an_edited_copy_was_kept_retry
source: An edited copy was kept: retry the preview, or restore from “Kept documents”.
zh_hans: 编辑副本已保留：可重试预览，或从“保留的文档”恢复。

# documents.office_opening_policy.an_edited_copy_was_kept_retry_2
source: An edited copy was kept: retry the preview or restore the edited copy; confirm the page content before saving.
zh_hans: 编辑副本已保留：可重试预览，或恢复编辑副本；保存前请确认页面内容。

# documents.office_opening_policy.an_edited_copy_was_kept_retry_3
source: An edited copy was kept: retry, or restore from “Kept documents”.
zh_hans: 编辑副本已保留：可重试，或从“保留的文档”恢复。

# documents.office_opening_policy.the_document_engine_could_not_open
source: The document engine could not open the document in time
zh_hans: 文档引擎未能在限定时间内打开文档

# documents.office_opening_policy.the_presentation_has_not_finished_its
source: The presentation has not finished its first render
zh_hans: 演示文稿尚未完成首次渲染

# edit.conflict.applyMine
source: Apply my changes
zh_hans: 应用我的修改

# edit.conflict.automatic
source: Changes in separate places are combined. Review and save.
zh_hans: 已合并不同位置的修改，请预览后保存

# edit.conflict.choose
source: Choose
zh_hans: 请选择

# edit.conflict.compareVersions
source: Compare document versions
zh_hans: 比较文档版本

# edit.conflict.current
source: Current file
zh_hans: 当前文件

# edit.conflict.deleted
source: Content deleted here
zh_hans: 此处内容已删除

# edit.conflict.draftChanged
source: Your draft changed. Your new edits are preserved; save again to review the conflict.
zh_hans: 草稿已发生变化，已保留你的新修改。请重新保存并检查冲突。

# edit.conflict.explanation
source: The file changed while you were editing. Changes in separate places are combined; choose which overlapping changes to keep. The version will be checked again when saving.
zh_hans: 文件在你编辑期间有了新的修改。不同位置的改动已合并；重叠部分由你选择。保存时会再次检查版本。

# edit.conflict.exportVersion
source: Export this version
zh_hans: 导出此版本

# edit.conflict.keep
source: Keep
zh_hans: 保留内容

# edit.conflict.keepBoth
source: Keep both versions
zh_hans: 保留两个版本

# edit.conflict.later
source: Resolve later
zh_hans: 稍后处理

# edit.conflict.loadingVersions
source: Preparing version snapshots…
zh_hans: 正在准备版本快照…

# edit.conflict.manualHint
source: Edit the combined result if needed. Changing a conflict choice resets these manual edits.
zh_hans: 可继续编辑合并结果；重新选择冲突项会重置这里的手动修改。

# edit.conflict.mine
source: My changes
zh_hans: 我的修改

# edit.conflict.notesApplyHint
source: These excerpts show text only. Open each version to check handwriting, images and layout. Applying your changes affects the original edited objects; unrelated content is retained. The recovery copy stays available.
zh_hans: 这里只显示文字摘要；请打开版本检查笔迹、图片和布局。应用修改会替换本次编辑涉及的内容，其余内容保留。恢复副本仍然保留。

# edit.conflict.notesCopy
source: Recovered edit
zh_hans: 编辑恢复副本

# edit.conflict.notesCopyChanged
source: The recovery copy has been edited again. Keep both versions and continue in that copy; the older reviewed changes were not applied.
zh_hans: 恢复副本已有新的编辑。请保留两个版本，在副本中继续；本次没有将旧的审阅结果应用到原件。

# edit.conflict.notesPreserved
source: This content changed during editing. Your changes are preserved in a separate, reopenable Notes document. Review both versions before applying your changes to the original.
zh_hans: 编辑期间内容发生了变化。你的修改已保存在可重新打开的独立手记副本中。请对照两个版本，再决定是否将修改应用到原件。

# edit.conflict.notesReview
source: Review conflicting edits
zh_hans: 查看编辑冲突

# edit.conflict.notesReviewUpdated
source: The original changed again. The review has been refreshed; compare the latest version before applying your changes.
zh_hans: 原件又有新的修改。审阅内容已刷新，请对照最新版本后再应用。

# edit.conflict.officeExplanation
source: This document changed while you were editing. Open either version to compare it, or export both. Office formatting, images and document structure are retained; versions are not automatically combined.
zh_hans: 编辑期间原文档已被修改。可分别打开两个版本对照，或导出保留。Office 的格式、图片及文档结构都会保留，不自动拼合两个文档。

# edit.conflict.officeRetained
source: The original and your recoverable draft stay intact. Exporting a version does not resolve or overwrite the original.
zh_hans: 原文件和你的编辑草稿均保留。导出版本不会覆盖原文件，也不会将冲突标为已解决。

# edit.conflict.openVersion
source: Open this version
zh_hans: 打开此版本

# edit.conflict.original
source: Original
zh_hans: 原版本

# edit.conflict.previewLimited
source: Preview shortened. The complete content is retained in the combined result and recovery copy.
zh_hans: 预览已缩短；完整内容保留在合并结果及恢复副本中。

# edit.conflict.recovery
source: A copy of your draft is saved in the workspace
zh_hans: 你的草稿副本已保存在工作区

# edit.conflict.region %lld
source: Conflict %lld
zh_hans: 冲突 %lld

# edit.conflict.result
source: Merged result
zh_hans: 合并结果

# edit.conflict.save
source: Merge and save
zh_hans: 合并并保存

# edit.conflict.title
source: Review file conflicts
zh_hans: 检查文件冲突

# editor.adjust
source: Adjust
zh_hans: 调整

# editor.crop
source: Crop
zh_hans: 裁剪

# editor.resize
source: Resize
zh_hans: 调整大小

# editor.rotate
source: Rotate
zh_hans: 旋转

# editor.strip
source: Strip
zh_hans: 移除元数据

# editor.undo
source: Undo
zh_hans: 撤销

# empty.conversations
source: Start a task to create your first conversation.
zh_hans: 开始一个任务来创建首次对话。

# empty.detail
source: Select an item to see its details.
zh_hans: 选择一个项目以查看详情。

# empty.diagnostics
source: Diagnostics are available in internal builds.
zh_hans: 诊断功能仅在内部构建中可用。

# empty.files
source: Files you open or attach will appear here.
zh_hans: 你打开或附加的文件会显示在这里。

# empty.home
source: Start a task and its progress will appear here.
zh_hans: 开始一个任务，进展会显示在这里。

# empty.hosts
source: Add a host you are authorized to operate.
zh_hans: 添加一台你有权操作的主机。

# empty.privacy
source: Privacy details will appear here.
zh_hans: 隐私说明会显示在这里。

# empty.providers
source: Add a model provider to begin.
zh_hans: 添加模型提供商后即可开始。

# empty.runs
source: Finished and active runs will appear here.
zh_hans: 已完成和进行中的运行会显示在这里。

# empty.settings
source: Settings will appear here.
zh_hans: 设置选项会显示在这里。

# engineering.cad.discard
source: Discard changes
zh_hans: 放弃修改

# engineering.cad.keepEditing
source: Keep editing
zh_hans: 继续编辑

# engineering.cad.keepSession
source: Keep edits and exit fullscreen
zh_hans: 保留修改并退出全屏

# engineering.cad.unsaved
source: This drawing has unsaved changes.
zh_hans: 图纸有未保存的修改。

# engineering.done
source: Done
zh_hans: 完成

# engineering.failed
source: Unable to preview
zh_hans: 无法预览

# engineering.fullscreen
source: Full-screen preview
zh_hans: 全屏预览

# engineering.processStopped
source: The viewer stopped. Close other previews or use a smaller file, then retry.
zh_hans: 查看器已停止。请关闭其他预览，或使用较小文件后重试。

# engineering.retry
source: Retry
zh_hans: 重试

# engineering.review.actions
source: Actions
zh_hans: 操作

# engineering.review.cancel
source: Cancel
zh_hans: 取消

# engineering.review.configureModel
source: Configure a model before asking about a drawing.
zh_hans: 请先配置模型，再提问图纸内容。

# engineering.review.evidence
source: Included drawing information
zh_hans: 附带的图纸信息

# engineering.review.model
source: Model
zh_hans: 模型

# engineering.review.placeholder
source: What would you like to check?
zh_hans: 想让助手检查哪些内容？

# engineering.review.question
source: Your question
zh_hans: 你的问题

# engineering.review.scope
source: Includes the visible viewport, parsed geometry and text, source hashes, and missing-resource information. Partial renderings do not establish engineering compliance.
zh_hans: 附上当前画面、解析到的几何与文字、文件版本和缺失资源。局部预览不能替代工程验收。

# engineering.review.send
source: Send
zh_hans: 发送

# engineering.review.snapshot
source: Current drawing viewport
zh_hans: 当前图纸画面

# engineering.review.title
source: Drawing Assistant
zh_hans: 图纸助手

# engineering.review.workspaceChanged
source: The active workspace changed. Reopen this drawing to continue.
zh_hans: 当前工作区已切换，请重新打开图纸后继续。

# engineering.timeout
source: This file exceeded the preview time limit. Try a smaller or simplified model.
zh_hans: 文件处理超时，请使用较小或简化后的模型重试。

# engineering.unsupported.description
source: Export 2D drawings to DXF or PDF, or 3D models to GLB or STL. The original file remains unchanged.
zh_hans: 二维图纸可先导出为 DXF 或 PDF，三维模型可导出为 GLB 或 STL。原文件保持不变。

# engineering.unsupported.title
source: Decoder not available
zh_hans: 此格式的查看器尚未接入

# envdetail.auto_install
source: Automatic (dependency)
zh_hans: 自动（依赖）

# envdetail.base_version
source: Base version
zh_hans: 基础层版本

# envdetail.delete_message
source: Tasks in this environment will be stopped, and its software and data will be deleted. A project with child conversations must be cleaned up first. If stopping fails, data is kept.
zh_hans: 将停止此环境的任务并删除其软件和数据。有子会话的项目须先清理子会话；停止失败时保留数据。

# envdetail.delete_title
source: Delete this environment?
zh_hans: 删除此环境？

# envdetail.identity
source: Environment identity and ownership
zh_hans: 环境标识与归属

# envdetail.kernel
source: Kernel
zh_hans: 内核

# envdetail.language_deps
source: Language packages
zh_hans: 语言依赖

# envdetail.last_size
source: Last recorded size
zh_hans: 上次记录的容量

# envdetail.manual_install
source: Manual install
zh_hans: 手动安装

# envdetail.owner
source: Owning project or conversation
zh_hans: 所属项目或会话

# envdetail.parent
source: Parent environment
zh_hans: 父环境

# envdetail.rebuild_default
source: Software needs rebuilding; your data is kept.
zh_hans: 软件需要重建；数据已保留。

# envdetail.resume
source: Start environment
zh_hans: 恢复环境

# envdetail.search_packages
source: Search installed software
zh_hans: 搜索软件包

# envdetail.size
source: Size of this layer
zh_hans: 本层容量

# envdetail.status
source: Status
zh_hans: 状态

# envdetail.stop_tasks
source: Stop tasks in this environment
zh_hans: 停止此环境的任务

# envdetail.system
source: System
zh_hans: 系统

# envdetail.template_hint
source: Stop the environment before saving a template so the installed software matches.
zh_hans: 先停止环境，再保存模板，确保软件副本一致。

# envdetail.type
source: Type
zh_hans: 类型

# envdetail.working
source: Working…
zh_hans: 正在处理…

# envdetail.working_selected
source: Preparing the selected environment…
zh_hans: 正在处理所选环境…

# environment.backend.active_vm
source: Active VM
zh_hans: 当前虚拟机

# environment.backend.base_image
source: Base image
zh_hans: 基础镜像

# environment.backend.checking
source: Reading guest status…
zh_hans: 正在读取客户机状态…

# environment.backend.component.installed
source: Installed (digest-verified)
zh_hans: 已安装（摘要校验通过）

# environment.backend.component_status
source: Component status
zh_hans: 组件状态

# environment.backend.distribution_hint
source: No downloadable Floe Linux image is published yet; only a locally built, verified image can be imported.
zh_hans: 尚未发布可下载的 Floe Linux 镜像；目前只能导入本地构建并通过校验的镜像。

# environment.backend.guest_runtimes
source: Guest runtimes
zh_hans: 客户机内运行时

# environment.backend.image
source: Linux image
zh_hans: Linux 镜像

# environment.backend.image_download
source: Download and install Linux
zh_hans: 下载并安装 Linux

# environment.backend.image_download_title
source: Downloading Linux image %@
zh_hans: 正在下载 Linux 镜像 %@

# environment.backend.image_downloading
source: Downloading and verifying Linux…
zh_hans: 正在下载并校验 Linux…

# environment.backend.image_installed
source: Installed Linux image %@
zh_hans: 已安装 Linux 镜像 %@

# environment.backend.image_missing
source: Linux is not installed yet. Download it first; start becomes available when the download completes.
zh_hans: 尚未安装 Linux，请先下载，完成后即可启动。

# environment.backend.image_phase.checking
source: Verifying the installed image…
zh_hans: 正在校验已安装镜像…

# environment.backend.image_phase.downloading
source: Downloading the image…
zh_hans: 正在下载镜像…

# environment.backend.image_phase.extracting
source: Extracting the image…
zh_hans: 正在解压镜像…

# environment.backend.image_phase.finalizing
source: Finishing the install…
zh_hans: 正在完成安装…

# environment.backend.image_phase.reconstructing
source: Rebuilding from verified data…
zh_hans: 正在从已验证数据重建…

# environment.backend.image_phase.verifying_archive
source: Verifying the downloaded archive…
zh_hans: 正在校验下载归档…

# environment.backend.image_phase.verifying_image
source: Verifying image files…
zh_hans: 正在校验镜像文件…

# environment.backend.image_retry
source: Retry image download
zh_hans: 重试下载镜像

# environment.backend.image_store_unavailable
source: This build has no durable image storage, so the Linux image cannot be downloaded here.
zh_hans: 此版本没有可用的镜像存储，无法在此下载 Linux 镜像。

# environment.backend.linux
source: Linux guest
zh_hans: Linux 客户机

# environment.backend.memory
source: Memory
zh_hans: 内存

# environment.backend.native
source: Native (iOS)
zh_hans: 原生 (iOS)

# environment.backend.native_hint
source: Native is the compatibility backend with the POSIX shell only (no Python/Node); Linux runs shell, Python, Node and services in one TinyEMU guest.
zh_hans: 原生为兼容后端，仅提供 POSIX Shell（无 Python/Node）；Linux 会在同一个 TinyEMU 客户机中运行 Shell、Python、Node 和服务。

# environment.backend.network
source: Guest network
zh_hans: 客户机网络

# environment.backend.network.down
source: Interface not configured
zh_hans: 网卡未配置成功

# environment.backend.network.partial
source: Interface up, DNS unanswered
zh_hans: 网卡已启用，DNS 无应答

# environment.backend.network.up
source: Working (interface, route and DNS)
zh_hans: 正常（网卡、路由和 DNS）

# environment.backend.picker
source: Backend
zh_hans: 后端

# environment.backend.repair
source: Repair and start
zh_hans: 修复并启动

# environment.backend.repair.nothing_recoverable
source: No preserved bytes remain to restore.
zh_hans: 没有可恢复的保留数据。

# environment.backend.repair.restore
source: Repair disk (restore preserved data)
zh_hans: 修复磁盘（恢复已保留的数据）

# environment.backend.repair.restored
source: Disk repaired: preserved data verified and captured (delta generation %lld). Nothing was deleted.
zh_hans: 磁盘已修复：保留数据已校验并捕获（增量代次 %lld）。未删除任何数据。

# environment.backend.repair.section
source: Disk repair
zh_hans: 磁盘修复

# environment.backend.repair.working
source: Verifying and restoring the preserved disk…
zh_hans: 正在校验并恢复已保留的磁盘…

# environment.backend.repair_image
source: Repair Linux image
zh_hans: 修复 Linux 镜像

# environment.backend.retry_init
source: Retry
zh_hans: 重试初始化

# environment.backend.reverify
source: Re-verify
zh_hans: 重新校验

# environment.backend.runtime_version
source: Runtime version
zh_hans: 运行时版本

# environment.backend.shared_runtime_section
source: Linux Runtime (Shared Component)
zh_hans: Linux 运行时（共享组件）

# environment.backend.start
source: Start Linux guest
zh_hans: 启动 Linux 客户机

# environment.backend.started
source: Started
zh_hans: 启动时间

# environment.backend.status
source: Guest status
zh_hans: 客户机状态

# environment.backend.status.installed_stopped
source: Component installed; guest stopped
zh_hans: 组件已安装；客户机已停止

# environment.backend.status.running
source: Running
zh_hans: 运行中

# environment.backend.status.stopped
source: Stopped
zh_hans: 已停止

# environment.backend.stop
source: Stop Linux guest
zh_hans: 停止 Linux 客户机

# environment.backend.storage_initializing
source: Preparing Linux image storage…
zh_hans: 正在准备 Linux 镜像存储…
